STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255cxx_ca35.h
/****************  Bit definition for GPIO_CIDCFGR10 register  ****************/
#define GPIO_CIDCFGR10_CFEN_Pos        (0U)
#define GPIO_CIDCFGR10_CFEN_Msk        (0x1UL << GPIO_CIDCFGR10_CFEN_Pos)        /*!< 0x00000001 */
#define GPIO_CIDCFGR10_CFEN            GPIO_CIDCFGR10_CFEN_Msk                  /*!< CID filtering enable */
#define GPIO_CIDCFGR10_SEM_EN_Pos      (1U)
#define GPIO_CIDCFGR10_SEM_EN_Msk      (0x1UL << GPIO_CIDCFGR10_SEM_EN_Pos)      /*!< 0x00000002 */
#define GPIO_CIDCFGR10_SEM_EN          GPIO_CIDCFGR10_SEM_EN_Msk                /*!< Semaphore enable */
#define GPIO_CIDCFGR10_SCID_Pos        (4U)
#define GPIO_CIDCFGR10_SCID_Msk        (0x3UL << GPIO_CIDCFGR10_SCID_Pos)        /*!< 0x00000030 */
#define GPIO_CIDCFGR10_SCID            GPIO_CIDCFGR10_SCID_Msk                  /*!< Static CID */
#define GPIO_CIDCFGR10_SEMWLC0_Pos     (16U)
#define GPIO_CIDCFGR10_SEMWLC0_Msk     (0x1UL << GPIO_CIDCFGR10_SEMWLC0_Pos)     /*!< 0x00010000 */
#define GPIO_CIDCFGR10_SEMWLC0         GPIO_CIDCFGR10_SEMWLC0_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR10_SEMWLC1_Pos     (17U)
#define GPIO_CIDCFGR10_SEMWLC1_Msk     (0x1UL << GPIO_CIDCFGR10_SEMWLC1_Pos)     /*!< 0x00020000 */
#define GPIO_CIDCFGR10_SEMWLC1         GPIO_CIDCFGR10_SEMWLC1_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR10_SEMWLC2_Pos     (18U)
#define GPIO_CIDCFGR10_SEMWLC2_Msk     (0x1UL << GPIO_CIDCFGR10_SEMWLC2_Pos)     /*!< 0x00040000 */
#define GPIO_CIDCFGR10_SEMWLC2         GPIO_CIDCFGR10_SEMWLC2_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR10_SEMWLC3_Pos     (19U)
#define GPIO_CIDCFGR10_SEMWLC3_Msk     (0x1UL << GPIO_CIDCFGR10_SEMWLC3_Pos)     /*!< 0x00080000 */
#define GPIO_CIDCFGR10_SEMWLC3         GPIO_CIDCFGR10_SEMWLC3_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */

/*****************  Bit definition for GPIO_SEMCR10 register  *****************/
#define GPIO_SEMCR10_SEM_MUTEX_Pos     (0U)
#define GPIO_SEMCR10_SEM_MUTEX_Msk     (0x1UL << GPIO_SEMCR10_SEM_MUTEX_Pos)     /*!< 0x00000001 */
#define GPIO_SEMCR10_SEM_MUTEX         GPIO_SEMCR10_SEM_MUTEX_Msk               /*!< Semaphore Mutex */
#define GPIO_SEMCR10_SEMCID_Pos        (4U)
#define GPIO_SEMCR10_SEMCID_Msk        (0x3UL << GPIO_SEMCR10_SEMCID_Pos)        /*!< 0x00000030 */
#define GPIO_SEMCR10_SEMCID            GPIO_SEMCR10_SEMCID_Msk                  /*!< Semaphore current CID */

/****************  Bit definition for GPIO_CIDCFGR11 register  ****************/
#define GPIO_CIDCFGR11_CFEN_Pos        (0U)
#define GPIO_CIDCFGR11_CFEN_Msk        (0x1UL << GPIO_CIDCFGR11_CFEN_Pos)        /*!< 0x00000001 */
#define GPIO_CIDCFGR11_CFEN            GPIO_CIDCFGR11_CFEN_Msk                  /*!< CID filtering enable */
#define GPIO_CIDCFGR11_SEM_EN_Pos      (1U)
#define GPIO_CIDCFGR11_SEM_EN_Msk      (0x1UL << GPIO_CIDCFGR11_SEM_EN_Pos)      /*!< 0x00000002 */
#define GPIO_CIDCFGR11_SEM_EN          GPIO_CIDCFGR11_SEM_EN_Msk                /*!< Semaphore enable */
#define GPIO_CIDCFGR11_SCID_Pos        (4U)
#define GPIO_CIDCFGR11_SCID_Msk        (0x3UL << GPIO_CIDCFGR11_SCID_Pos)        /*!< 0x00000030 */
#define GPIO_CIDCFGR11_SCID            GPIO_CIDCFGR11_SCID_Msk                  /*!< Static CID */
#define GPIO_CIDCFGR11_SEMWLC0_Pos     (16U)
#define GPIO_CIDCFGR11_SEMWLC0_Msk     (0x1UL << GPIO_CIDCFGR11_SEMWLC0_Pos)     /*!< 0x00010000 */
#define GPIO_CIDCFGR11_SEMWLC0         GPIO_CIDCFGR11_SEMWLC0_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR11_SEMWLC1_Pos     (17U)
#define GPIO_CIDCFGR11_SEMWLC1_Msk     (0x1UL << GPIO_CIDCFGR11_SEMWLC1_Pos)     /*!< 0x00020000 */
#define GPIO_CIDCFGR11_SEMWLC1         GPIO_CIDCFGR11_SEMWLC1_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR11_SEMWLC2_Pos     (18U)
#define GPIO_CIDCFGR11_SEMWLC2_Msk     (0x1UL << GPIO_CIDCFGR11_SEMWLC2_Pos)     /*!< 0x00040000 */
#define GPIO_CIDCFGR11_SEMWLC2         GPIO_CIDCFGR11_SEMWLC2_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR11_SEMWLC3_Pos     (19U)
#define GPIO_CIDCFGR11_SEMWLC3_Msk     (0x1UL << GPIO_CIDCFGR11_SEMWLC3_Pos)     /*!< 0x00080000 */
#define GPIO_CIDCFGR11_SEMWLC3         GPIO_CIDCFGR11_SEMWLC3_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */

/*****************  Bit definition for GPIO_SEMCR11 register  *****************/
#define GPIO_SEMCR11_SEM_MUTEX_Pos     (0U)
#define GPIO_SEMCR11_SEM_MUTEX_Msk     (0x1UL << GPIO_SEMCR11_SEM_MUTEX_Pos)     /*!< 0x00000001 */
#define GPIO_SEMCR11_SEM_MUTEX         GPIO_SEMCR11_SEM_MUTEX_Msk               /*!< Semaphore Mutex */
#define GPIO_SEMCR11_SEMCID_Pos        (4U)
#define GPIO_SEMCR11_SEMCID_Msk        (0x3UL << GPIO_SEMCR11_SEMCID_Pos)        /*!< 0x00000030 */
#define GPIO_SEMCR11_SEMCID            GPIO_SEMCR11_SEMCID_Msk                  /*!< Semaphore current CID */

/****************  Bit definition for GPIO_CIDCFGR12 register  ****************/
#define GPIO_CIDCFGR12_CFEN_Pos        (0U)
#define GPIO_CIDCFGR12_CFEN_Msk        (0x1UL << GPIO_CIDCFGR12_CFEN_Pos)        /*!< 0x00000001 */
#define GPIO_CIDCFGR12_CFEN            GPIO_CIDCFGR12_CFEN_Msk                  /*!< CID filtering enable */
#define GPIO_CIDCFGR12_SEM_EN_Pos      (1U)
#define GPIO_CIDCFGR12_SEM_EN_Msk      (0x1UL << GPIO_CIDCFGR12_SEM_EN_Pos)      /*!< 0x00000002 */
#define GPIO_CIDCFGR12_SEM_EN          GPIO_CIDCFGR12_SEM_EN_Msk                /*!< Semaphore enable */
#define GPIO_CIDCFGR12_SCID_Pos        (4U)
#define GPIO_CIDCFGR12_SCID_Msk        (0x3UL << GPIO_CIDCFGR12_SCID_Pos)        /*!< 0x00000030 */
#define GPIO_CIDCFGR12_SCID            GPIO_CIDCFGR12_SCID_Msk                  /*!< Static CID */
#define GPIO_CIDCFGR12_SEMWLC0_Pos     (16U)
#define GPIO_CIDCFGR12_SEMWLC0_Msk     (0x1UL << GPIO_CIDCFGR12_SEMWLC0_Pos)     /*!< 0x00010000 */
#define GPIO_CIDCFGR12_SEMWLC0         GPIO_CIDCFGR12_SEMWLC0_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR12_SEMWLC1_Pos     (17U)
#define GPIO_CIDCFGR12_SEMWLC1_Msk     (0x1UL << GPIO_CIDCFGR12_SEMWLC1_Pos)     /*!< 0x00020000 */
#define GPIO_CIDCFGR12_SEMWLC1         GPIO_CIDCFGR12_SEMWLC1_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR12_SEMWLC2_Pos     (18U)
#define GPIO_CIDCFGR12_SEMWLC2_Msk     (0x1UL << GPIO_CIDCFGR12_SEMWLC2_Pos)     /*!< 0x00040000 */
#define GPIO_CIDCFGR12_SEMWLC2         GPIO_CIDCFGR12_SEMWLC2_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR12_SEMWLC3_Pos     (19U)
#define GPIO_CIDCFGR12_SEMWLC3_Msk     (0x1UL << GPIO_CIDCFGR12_SEMWLC3_Pos)     /*!< 0x00080000 */
#define GPIO_CIDCFGR12_SEMWLC3         GPIO_CIDCFGR12_SEMWLC3_Msk               /*!< Semaphore whitelist for compartment y (y=0 to 3) */

/*****************  Bit definition for GPIO_SEMCR12 register  *****************/
#define GPIO_SEMCR12_SEM_MUTEX_Pos     (0U)
#define GPIO_SEMCR12_SEM_MUTEX_Msk     (0x1UL << GPIO_SEMCR12_SEM_MUTEX_Pos)     /*!< 0x00000001 */
#define GPIO_SEMCR12_SEM_MUTEX         GPIO_SEMCR12_SEM_MUTEX_Msk               /*!< Semaphore Mutex */
#define GPIO_SEMCR12_SEMCID_Pos        (4U)
#define GPIO_SEMCR12_SEMCID_Msk        (0x3UL << GPIO_SEMCR12_SEMCID_Pos)        /*!< 0x00000030 */
#define GPIO_SEMCR12_SEMCID            GPIO_SEMCR12_SEMCID_Msk                  /*!< Semaphore current CID */

