STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255cxx_ca35.h
/*******************  Bit definition for SAES_ICR register     ******************/
#define SAES_ICR_CCF_Pos                    (0U)
#define SAES_ICR_CCF_Msk                    (0x1UL << SAES_ICR_CCF_Pos)             /*!< 0x00000001 */
#define SAES_ICR_CCF                        SAES_ICR_CCF_Msk                        /*!< Computation complete flag clear */
#define SAES_ICR_RWEIF_Pos                  (1U)
#define SAES_ICR_RWEIF_Msk                  (0x1UL << SAES_ICR_RWEIF_Pos)           /*!< 0x00000002 */
#define SAES_ICR_RWEIF                      SAES_ICR_RWEIF_Msk                      /*!< Read or write error Interrupt flag clear */
#define SAES_ICR_KEIF_Pos                   (2U)
#define SAES_ICR_KEIF_Msk                   (0x1UL << SAES_ICR_KEIF_Pos)            /*!< 0x00000004 */
#define SAES_ICR_KEIF                       SAES_ICR_KEIF_Msk                       /*!< Key error interrupt flag clear */
#define SAES_ICR_RNGEIF_Pos                 (3U)
#define SAES_ICR_RNGEIF_Msk                 (0x1UL << SAES_ICR_RNGEIF_Pos)          /*!< 0x00000008 */
#define SAES_ICR_RNGEIF                     SAES_ICR_RNGEIF_Msk                     /*!< RNG error interrupt flag clear */

/**************  Bit definition for SAES_HWCFGR register  **************/
#define SAES_HWCFGR_CFG1_Pos                (0U)
#define SAES_HWCFGR_CFG1_Msk                (0xFUL << SAES_HWCFGR_CFG1_Pos)          /*!< 0x0000000F */
#define SAES_HWCFGR_CFG1                    SAES_HWCFGR_CFG1_Msk                    /*!< HW Generic 1 */
#define SAES_HWCFGR_CFG2_Pos                (4U)
#define SAES_HWCFGR_CFG2_Msk                (0xFUL << SAES_HWCFGR_CFG2_Pos)          /*!< 0x000000F0 */
#define SAES_HWCFGR_CFG2                    SAES_HWCFGR_CFG2_Msk                    /*!< Hardware Generic 2 */
#define SAES_HWCFGR_CFG3_Pos                (8U)
#define SAES_HWCFGR_CFG3_Msk                (0xFUL << SAES_HWCFGR_CFG3_Pos)          /*!< 0x00000F00 */
#define SAES_HWCFGR_CFG3                    SAES_HWCFGR_CFG3_Msk                    /*!< Hardware Generic 3 */

/******************  Bit definition for SAES_VERR register  *******************/
#define SAES_VERR_MINREV_Pos               (0U)
#define SAES_VERR_MINREV_Msk               (0xFUL << SAES_VERR_MINREV_Pos)            /*!< 0x0000000F */
#define SAES_VERR_MINREV                   SAES_VERR_MINREV_Msk                      /*!< Minor revision */
#define SAES_VERR_MAJREV_Pos               (4U)
#define SAES_VERR_MAJREV_Msk               (0xFUL << SAES_VERR_MAJREV_Pos)            /*!< 0x000000F0 */
#define SAES_VERR_MAJREV                   SAES_VERR_MAJREV_Msk                      /*!< Major revision */

/******************  Bit definition for SAES_IPIDR register  ******************/
#define SAES_IPIDR_ID_Pos                 (0U)
#define SAES_IPIDR_ID_Msk                 (0xFFFFFFFFUL << SAES_IPIDR_ID_Pos)        /*!< 0xFFFFFFFF */
#define SAES_IPIDR_ID                     SAES_IPIDR_ID_Msk                         /*!< Identification code of the peripheral */

/******************  Bit definition for SAES_SIDR register  *******************/
#define SAES_SIDR_SID_Pos                 (0U)
#define SAES_SIDR_SID_Msk                 (0xFFFFFFFFUL << SAES_SIDR_SID_Pos)        /*!< 0xFFFFFFFF */
#define SAES_SIDR_SID                     SAES_SIDR_SID_Msk                         /*!< Size identification code */

/******************************************************************************/
/*                                                                            */
/*                          Serial Audio Interface                            */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for SAI_GCR register  *******************/
#define SAI_GCR_SYNCIN_Pos         (0U)
#define SAI_GCR_SYNCIN_Msk         (0x3UL << SAI_GCR_SYNCIN_Pos)                /*!< 0x00000003 */
#define SAI_GCR_SYNCIN             SAI_GCR_SYNCIN_Msk                           /*!<SYNCIN[1:0] bits (Synchronization Inputs)   */
#define SAI_GCR_SYNCIN_0           (0x1UL << SAI_GCR_SYNCIN_Pos)                /*!< 0x00000001 */
#define SAI_GCR_SYNCIN_1           (0x2UL << SAI_GCR_SYNCIN_Pos)                /*!< 0x00000002 */

#define SAI_GCR_SYNCOUT_Pos        (4U)
#define SAI_GCR_SYNCOUT_Msk        (0x3UL << SAI_GCR_SYNCOUT_Pos)               /*!< 0x00000030 */
#define SAI_GCR_SYNCOUT            SAI_GCR_SYNCOUT_Msk                          /*!<SYNCOUT[1:0] bits (Synchronization Outputs) */
#define SAI_GCR_SYNCOUT_0          (0x1UL << SAI_GCR_SYNCOUT_Pos)               /*!< 0x00000010 */
#define SAI_GCR_SYNCOUT_1          (0x2UL << SAI_GCR_SYNCOUT_Pos)               /*!< 0x00000020 */

/*******************  Bit definition for SAI_xCR1 register  *******************/
#define SAI_xCR1_MODE_Pos          (0U)
#define SAI_xCR1_MODE_Msk          (0x3UL << SAI_xCR1_MODE_Pos)                 /*!< 0x00000003 */
#define SAI_xCR1_MODE              SAI_xCR1_MODE_Msk                            /*!<MODE[1:0] bits (Audio Block Mode)           */
#define SAI_xCR1_MODE_0            (0x1UL << SAI_xCR1_MODE_Pos)                 /*!< 0x00000001 */
#define SAI_xCR1_MODE_1            (0x2UL << SAI_xCR1_MODE_Pos)                 /*!< 0x00000002 */

#define SAI_xCR1_PRTCFG_Pos        (2U)
#define SAI_xCR1_PRTCFG_Msk        (0x3UL << SAI_xCR1_PRTCFG_Pos)               /*!< 0x0000000C */
#define SAI_xCR1_PRTCFG            SAI_xCR1_PRTCFG_Msk                          /*!<PRTCFG[1:0] bits (Protocol Configuration)   */
#define SAI_xCR1_PRTCFG_0          (0x1UL << SAI_xCR1_PRTCFG_Pos)               /*!< 0x00000004 */
#define SAI_xCR1_PRTCFG_1          (0x2UL << SAI_xCR1_PRTCFG_Pos)               /*!< 0x00000008 */

#define SAI_xCR1_DS_Pos            (5U)
#define SAI_xCR1_DS_Msk            (0x7UL << SAI_xCR1_DS_Pos)                   /*!< 0x000000E0 */
#define SAI_xCR1_DS                SAI_xCR1_DS_Msk                              /*!<DS[1:0] bits (Data Size) */
#define SAI_xCR1_DS_0              (0x1UL << SAI_xCR1_DS_Pos)                   /*!< 0x00000020 */
#define SAI_xCR1_DS_1              (0x2UL << SAI_xCR1_DS_Pos)                   /*!< 0x00000040 */
#define SAI_xCR1_DS_2              (0x4UL << SAI_xCR1_DS_Pos)                   /*!< 0x00000080 */

#define SAI_xCR1_LSBFIRST_Pos      (8U)
#define SAI_xCR1_LSBFIRST_Msk      (0x1UL << SAI_xCR1_LSBFIRST_Pos)             /*!< 0x00000100 */
#define SAI_xCR1_LSBFIRST          SAI_xCR1_LSBFIRST_Msk                        /*!<LSB First Configuration  */
#define SAI_xCR1_CKSTR_Pos         (9U)
#define SAI_xCR1_CKSTR_Msk         (0x1UL << SAI_xCR1_CKSTR_Pos)                /*!< 0x00000200 */
#define SAI_xCR1_CKSTR             SAI_xCR1_CKSTR_Msk                           /*!<ClocK STRobing edge      */

