STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255cxx_ca35.h
/******************************* WWDG Instances *******************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE) (((INSTANCE) == WWDG1) || \
                                        ((INSTANCE) == WWDG2))

/******************************* CRC VERSION ********************************/
#define CRC_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* CRYP VERSION ********************************/
#define CRYP_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* CSI VERSION ********************************/
#define CSI_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* DCMI VERSION ********************************/
#define DCMI_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* DCMIPP VERSION ********************************/
#define DCMIPP_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* DMA VERSION ********************************/
#define DMA_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* DSI VERSION ********************************/
#define DSI_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* EXTI VERSION ********************************/
#define EXTI_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* HASH VERSION ********************************/
#define HASH_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* GPIO VERSION ********************************/
#define GPIO_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* HDP VERSION ********************************/
#define HDP_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* I2C VERSION ********************************/
#define I2C_VERSION(INSTANCE) ((INSTANCE)->VERR)

/******************************* IPCC VERSION ********************************/
#define IPCC_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* IWDG VERSION ********************************/
#define IWDG_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* LPTIM VERSION ********************************/
#define LPTIM_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* RNG VERSION ********************************/
#define OSPI_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* PSSI VERSION ********************************/
#define PSSI_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* PKA VERSION ********************************/
#define PKA_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* PWR VERSION ********************************/
#define PWR_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* RAMCFG VERSION ********************************/
#define RAMCFG_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* RCC VERSION ********************************/
#define RCC_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* RIFSC VERSION ********************************/
#define RIFSC_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* RISAB VERSION ********************************/
#define RISAB_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* RISAF VERSION ********************************/
#define RISAF_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* IAC VERSION ********************************/
#define IAC_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* RNG VERSION ********************************/
#define RNG_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* RTC VERSION ********************************/
#define RTC_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* SAES VERSION ******************************/
#define SAES_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* SAI VERSION ****************************/
#define SAI_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* SDMMC VERSION ******************************/
#define SDMMC_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* SPDIFRX VERSION ****************************/
#define SPDIFRX_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* SPI/I2S VERSION ****************************/
#define SPI_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* TAMP VERSION ********************************/
#define TAMP_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* TIM VERSION ********************************/
#define TIM_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* USART VERSION ********************************/
#define USART_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* WWDG VERSION ********************************/
#define WWDG_VERSION(__INSTANCE__) ((__INSTANCE__)->VERR)

/******************************* DEVICE VERSION ********************************/
#define DEVICE_REVISION() (((DBGMCU->IDCODE) & (DBGMCU_IDCODE_REV_ID_Msk)) >> DBGMCU_IDCODE_REV_ID_Pos)
#define IS_DEVICE_REV_A() (DEVICE_REVISION() == 0x1000)

/******************************* DEVICE ID  ************************************/
#define DEVICE_ID() ((DBGMCU->IDCODE) & (DBGMCU_IDCODE_DEV_ID_Msk))


#define BOOT_MODE() ((SYSCFG->BOOTSR) & (SYSCFG_BOOTSR_BOOT3|SYSCFG_BOOTSR_BOOT2|SYSCFG_BOOTSR_BOOT1|SYSCFG_BOOTSR_BOOT0))

/**
  * @brief  Check whether platform is Developer boot mode
  * @param  None
  * @retval TRUE or FALSE
  */
#define IS_DEVELOPER_BOOT_MODE()   ((BOOT_MODE()  == (SYSCFG_BOOTSR_BOOT1 | SYSCFG_BOOTSR_BOOT0)) || \
                                    (BOOT_MODE()  == (SYSCFG_BOOTSR_BOOT3 | SYSCFG_BOOTSR_BOOT2)))
/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __STM32MP255Cxx_CA35_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
